# FabricParamLocationSlab Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamLocationSlab Property
ParameterTypeId Class See Also
---
"Location": Fabric location in the slab
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamLocationSlab { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamLocationSlab As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamLocationSlab {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace